## Plan for aft/notifications
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                 NAME                                                 |
|--------|------------------------------------------------------------------------------------------------------|
| add    | `aws_kms_key.aft_cloudwatch_alarms`                                                                  |
|        | `aws_sns_topic.aft_cloudwatch_alarms`                                                                |
|        | `aws_sns_topic_subscription.aft_cloudwatch_alarms_slack`                                             |
| update | `aws_cloudwatch_metric_alarm.pipeline_failed[&quot;/aws/codebuild/aft-account-customizations-terraform&quot;]` |
|        | `aws_cloudwatch_metric_alarm.pipeline_failed[&quot;/aws/codebuild/aft-global-customizations-terraform&quot;]`  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.pipeline_failed["/aws/codebuild/aft-account-customizations-terraform"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "pipeline_failed" {
      ~ alarm_actions             = [
          - "arn:aws:sns:ca-central-1:137554749751:aft-failure-notifications",
        ] -> (known after apply)
        id                        = "PipelineFailed-aft-account-customizations-terraform"
      ~ ok_actions                = [
          - "arn:aws:sns:ca-central-1:137554749751:aft-failure-notifications",
        ] -> (known after apply)
        tags                      = {}
        # (16 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.pipeline_failed["/aws/codebuild/aft-global-customizations-terraform"] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "pipeline_failed" {
      ~ alarm_actions             = [
          - "arn:aws:sns:ca-central-1:137554749751:aft-failure-notifications",
        ] -> (known after apply)
        id                        = "PipelineFailed-aft-global-customizations-terraform"
      ~ ok_actions                = [
          - "arn:aws:sns:ca-central-1:137554749751:aft-failure-notifications",
        ] -> (known after apply)
        tags                      = {}
        # (16 unchanged attributes hidden)
    }

  # aws_kms_key.aft_cloudwatch_alarms will be created
  + resource "aws_kms_key" "aft_cloudwatch_alarms" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "KMS key for AFT CloudWatch Alarm SNS topic"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::137554749751:root"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "kms:GenerateDataKey*",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudwatch.amazonaws.com"
                        }
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags                               = {
          + "CostCentre" = "cds-aft-management-production"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "cds-aft-management-production"
          + "Terraform"  = "true"
        }
    }

  # aws_sns_topic.aft_cloudwatch_alarms will be created
  + resource "aws_sns_topic" "aft_cloudwatch_alarms" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = (known after apply)
      + name                        = "aft-cloudwatch-alarms"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags                        = {
          + "CostCentre" = "cds-aft-management-production"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "cds-aft-management-production"
          + "Terraform"  = "true"
        }
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_subscription.aft_cloudwatch_alarms_slack will be created
  + resource "aws_sns_topic_subscription" "aft_cloudwatch_alarms_slack" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "https://sre-bot.cdssandbox.xyz/hook/4a4e3c29-473b-4c0c-9216-78b0b189cae5"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "https"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

Plan: 3 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.pipeline_failed[\"/aws/codebuild/aft-account-customizations-terraform\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.pipeline_failed[\"/aws/codebuild/aft-global-customizations-terraform\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.aft_failure_notifications.aws_cloudwatch_log_group.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.aft_failure_notifications.aws_iam_policy.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.aft_failure_notifications.aws_iam_role.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.aft_failure_notifications.aws_lambda_function.notify_slack"]

25 tests, 19 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
